app/Http/Controllers/Auth/RegisterController.php

insert into `user_role` (`role_id`, `user_id`) values (2, 6)
---
    protected function create(array $data)
    {
        $userObj = User::create([
            'name' => $data['name'],
            'email' => $data['email'],
            'password' => bcrypt($data['password']),
        ]);
        if($userObj){
		        $userObj->roles()->attach(2);