app/Article.php

		public function scopeLastArticles($query, $count){
				return $query->orderBy('created_at', 'desc')->take($count)->get();
---
select * from `articles` order by `created_at` desc limit 5