app/Category.php

select * from `categories` order by `created_at` desc limit 5
---
		public function scopeLastCategories($query, $count){
			return $query->orderBy('created_at', 'desc')->take($count)->get();