app/Http/Controllers/BlogController.php

		public function category($slug){

				$p = ('public/categories/1589742371undraw_code_thinking_1jeh.png');
				$t = Storage::url($p);

				$category = Category::where('slug', $slug)->first();
---
select * from `categories` where `slug` = '2404200932' limit 1

		public function article($slug){

				$article = Article::where('slug', $slug)->first();
---
select * from `articles` where `slug` = 'moi-pravki-nodejs-0105202306' limit 1