app/Http/Controllers/SearchController.php

select * from `articles` where `title` LIKE '%shop%'
---
    public function search(Request $request){
				$search =trim(strip_tags($request->get('q')));

		    //return response()->json($request->all());
				$res = DB::table('articles')
						->where('title', 'LIKE', '%'.$search.'%')
						->get();