app/Providers/BlogServiceProvider.php

select * from `categories` where `parent_id` = 0 and `published` = 1
---
		public function topMenu(){
			View::composer('layouts.header', function($view){
					$view->with('categories', \App\Category::where('parent_id', 0)->where('published', 1)->get());