app/Http/Controllers/Admin/ArticleController.php

    public function create()
    {
    		$tags = \App\Tag::all();
    		//dd(Category::with('children')->where('parent_id', 0)->get());
        return view('admin.articles.create', [
        		'tags' => $tags,
        		'article' => [],
		        'categories' => Category::with('children')->where('parent_id', 0)->get(),
		        'delimiter' => ''
        ]);
---
select * from `tags`
select * from `categories` where `categories`.`parent_id` in (1, 3, 4, 5, 6)

    public function edit(Article $article)
    {
    		$tags = \App\Tag::all();
    		$tags2 = [];
    		foreach($tags as $tag){
    				$tags2[$tag->id] = $tag->name;
		    }

		    return view('admin.articles.edit', [
				    'article' => $article,
				    'categories' => Category::with('children')->where('parent_id', 0)->get(),
				    'tags' => $tags,
				    'delimiter' => ''
		    ]);
---
select * from `tags`
select * from `categories` where `categories`.`parent_id` in (1, 3, 4, 5, 6)