app/Http/Controllers/Admin/CategoryController.php

    public function create()
    {
        return view('admin.categories.create', [
        		'category' => [],
		        'categories' => Category::with('children')->where('parent_id', 0)->get(),
		        'delimiter' => ''
        ]);
---
select * from `categories` where `categories`.`parent_id` in (1, 3, 4, 5, 6)

    public function edit(Category $category)
    {

		    return view('admin.categories.edit', [
				    'category' => $category,
				    'categories' => Category::with('children')->where('parent_id', 0)->get(),
				    'delimiter' => ''
		    ]);
---
select * from `categories` where `categories`.`parent_id` in (1, 3, 4, 5, 6)