app/Http/Controllers/Admin/DashboardController.php

		public function dashboard(){
				return view('admin.dashboard', [
						'categories' => Category::LastCategories(5),
						'articles' => Article::LastArticles(5),
						'count_categories' => Category::count(),
						'count_articles' => Article::count()
---
select count(*) as aggregate from `categories`
select count(*) as aggregate from `articles`