app/Http/Controllers/Admin/TagController.php

select * from `tags` limit 10 offset 0
select count(*) as aggregate from `tags`
---
    public function index(Tag $tagEdit)
    {
    	//	dd($tagEdit);
        $tags = Tag::paginate(10);